Revit 2024 API
BalusterPattern Methods
The BalusterPattern type exposes the following members.
Methods
Name | Description
Dispose
DuplicateBaluster
 Duplicates the baluster pointed by given index in the main baluster pattern.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBaluster
 Gets information about the given baluster from the main baluster pattern.
GetBalusterCount
 Gets the number of balusters in the main baluster pattern definition.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RemoveBaluster
 Removes a baluster from the main baluster pattern.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace